results/redis-kubernetes-3-node-benchmark.txt
====== PING_INLINE ======
  100000 requests completed in 5.23 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

26.35% <= 1 milliseconds
82.29% <= 2 milliseconds
92.88% <= 3 milliseconds
96.77% <= 4 milliseconds
98.07% <= 5 milliseconds
98.78% <= 6 milliseconds
99.38% <= 7 milliseconds
99.65% <= 8 milliseconds
99.81% <= 9 milliseconds
99.86% <= 10 milliseconds
99.92% <= 12 milliseconds
99.93% <= 14 milliseconds
99.96% <= 15 milliseconds
99.97% <= 17 milliseconds
99.98% <= 18 milliseconds
100.00% <= 18 milliseconds
19,116.80 requests per second

====== PING_BULK ======
  100000 requests completed in 5.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

23.44% <= 1 milliseconds
82.24% <= 2 milliseconds
93.46% <= 3 milliseconds
96.80% <= 4 milliseconds
98.20% <= 5 milliseconds
98.85% <= 6 milliseconds
99.42% <= 7 milliseconds
99.71% <= 8 milliseconds
99.76% <= 9 milliseconds
99.84% <= 10 milliseconds
99.85% <= 11 milliseconds
99.91% <= 12 milliseconds
99.97% <= 13 milliseconds
100.00% <= 13 milliseconds
18,399.26 requests per second

====== SET ======
  100000 requests completed in 5.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

22.08% <= 1 milliseconds
77.44% <= 2 milliseconds
90.68% <= 3 milliseconds
95.24% <= 4 milliseconds
97.51% <= 5 milliseconds
98.45% <= 6 milliseconds
99.06% <= 7 milliseconds
99.50% <= 8 milliseconds
99.67% <= 9 milliseconds
99.76% <= 10 milliseconds
99.83% <= 11 milliseconds
99.86% <= 12 milliseconds
99.88% <= 13 milliseconds
99.91% <= 14 milliseconds
99.93% <= 17 milliseconds
99.94% <= 18 milliseconds
99.95% <= 19 milliseconds
99.95% <= 21 milliseconds
99.96% <= 22 milliseconds
99.96% <= 23 milliseconds
99.96% <= 26 milliseconds
99.97% <= 28 milliseconds
99.97% <= 37 milliseconds
99.98% <= 38 milliseconds
100.00% <= 39 milliseconds
100.00% <= 39 milliseconds
17,534.63 requests per second

====== GET ======
  100000 requests completed in 5.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

21.80% <= 1 milliseconds
80.32% <= 2 milliseconds
93.34% <= 3 milliseconds
96.87% <= 4 milliseconds
98.49% <= 5 milliseconds
99.00% <= 6 milliseconds
99.44% <= 7 milliseconds
99.73% <= 8 milliseconds
99.84% <= 9 milliseconds
99.92% <= 10 milliseconds
99.93% <= 11 milliseconds
99.96% <= 12 milliseconds
99.97% <= 13 milliseconds
99.98% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
17,831.67 requests per second

====== INCR ======
  100000 requests completed in 5.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

24.53% <= 1 milliseconds
81.75% <= 2 milliseconds
92.86% <= 3 milliseconds
96.70% <= 4 milliseconds
97.87% <= 5 milliseconds
98.53% <= 6 milliseconds
99.07% <= 7 milliseconds
99.44% <= 8 milliseconds
99.64% <= 9 milliseconds
99.76% <= 10 milliseconds
99.81% <= 11 milliseconds
99.82% <= 12 milliseconds
99.86% <= 13 milliseconds
99.93% <= 14 milliseconds
99.95% <= 15 milliseconds
99.97% <= 16 milliseconds
99.97% <= 17 milliseconds
99.98% <= 23 milliseconds
99.98% <= 26 milliseconds
99.98% <= 37 milliseconds
99.98% <= 40 milliseconds
99.98% <= 41 milliseconds
99.99% <= 55 milliseconds
99.99% <= 56 milliseconds
100.00% <= 56 milliseconds
18,758.21 requests per second

====== LPUSH ======
  100000 requests completed in 5.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

21.68% <= 1 milliseconds
77.50% <= 2 milliseconds
91.91% <= 3 milliseconds
95.82% <= 4 milliseconds
97.46% <= 5 milliseconds
98.46% <= 6 milliseconds
99.09% <= 7 milliseconds
99.57% <= 8 milliseconds
99.72% <= 9 milliseconds
99.86% <= 10 milliseconds
99.88% <= 11 milliseconds
99.89% <= 12 milliseconds
99.90% <= 13 milliseconds
99.90% <= 17 milliseconds
99.90% <= 19 milliseconds
99.91% <= 21 milliseconds
99.94% <= 22 milliseconds
99.96% <= 23 milliseconds
99.96% <= 28 milliseconds
99.97% <= 29 milliseconds
99.97% <= 31 milliseconds
99.97% <= 34 milliseconds
99.97% <= 39 milliseconds
99.97% <= 40 milliseconds
99.98% <= 59 milliseconds
100.00% <= 60 milliseconds
100.00% <= 60 milliseconds
17,337.03 requests per second

====== RPUSH ======
  100000 requests completed in 6.24 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

14.97% <= 1 milliseconds
75.65% <= 2 milliseconds
94.05% <= 3 milliseconds
96.49% <= 4 milliseconds
97.99% <= 5 milliseconds
98.88% <= 6 milliseconds
99.39% <= 7 milliseconds
99.62% <= 8 milliseconds
99.76% <= 9 milliseconds
99.85% <= 10 milliseconds
99.91% <= 11 milliseconds
99.94% <= 12 milliseconds
99.97% <= 13 milliseconds
99.98% <= 19 milliseconds
99.99% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 21 milliseconds
16,035.92 requests per second

====== LPOP ======
  100000 requests completed in 5.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

20.73% <= 1 milliseconds
78.41% <= 2 milliseconds
92.13% <= 3 milliseconds
95.77% <= 4 milliseconds
97.53% <= 5 milliseconds
98.55% <= 6 milliseconds
99.27% <= 7 milliseconds
99.60% <= 8 milliseconds
99.74% <= 9 milliseconds
99.79% <= 10 milliseconds
99.84% <= 12 milliseconds
99.85% <= 13 milliseconds
99.86% <= 14 milliseconds
99.89% <= 15 milliseconds
99.92% <= 16 milliseconds
99.92% <= 19 milliseconds
99.92% <= 20 milliseconds
99.93% <= 21 milliseconds
99.96% <= 22 milliseconds
99.97% <= 23 milliseconds
99.98% <= 32 milliseconds
99.99% <= 33 milliseconds
100.00% <= 33 milliseconds
17,343.05 requests per second

====== RPOP ======
  100000 requests completed in 5.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

21.12% <= 1 milliseconds
76.25% <= 2 milliseconds
91.24% <= 3 milliseconds
95.32% <= 4 milliseconds
97.53% <= 5 milliseconds
98.46% <= 6 milliseconds
98.99% <= 7 milliseconds
99.38% <= 8 milliseconds
99.53% <= 9 milliseconds
99.69% <= 10 milliseconds
99.72% <= 11 milliseconds
99.74% <= 12 milliseconds
99.80% <= 13 milliseconds
99.83% <= 14 milliseconds
99.90% <= 15 milliseconds
99.93% <= 16 milliseconds
100.00% <= 17 milliseconds
17,226.53 requests per second

====== SADD ======
  100000 requests completed in 5.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

21.31% <= 1 milliseconds
75.63% <= 2 milliseconds
91.42% <= 3 milliseconds
95.77% <= 4 milliseconds
97.54% <= 5 milliseconds
98.44% <= 6 milliseconds
99.07% <= 7 milliseconds
99.48% <= 8 milliseconds
99.61% <= 9 milliseconds
99.68% <= 10 milliseconds
99.72% <= 11 milliseconds
99.74% <= 12 milliseconds
99.75% <= 14 milliseconds
99.77% <= 15 milliseconds
99.80% <= 16 milliseconds
99.84% <= 17 milliseconds
99.87% <= 18 milliseconds
99.88% <= 19 milliseconds
99.89% <= 20 milliseconds
99.90% <= 21 milliseconds
99.91% <= 22 milliseconds
99.93% <= 23 milliseconds
99.93% <= 24 milliseconds
99.95% <= 37 milliseconds
99.95% <= 43 milliseconds
99.95% <= 44 milliseconds
99.96% <= 45 milliseconds
99.96% <= 48 milliseconds
99.97% <= 49 milliseconds
99.99% <= 50 milliseconds
100.00% <= 50 milliseconds
16,832.18 requests per second

====== HSET ======
  100000 requests completed in 5.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

24.49% <= 1 milliseconds
80.11% <= 2 milliseconds
92.86% <= 3 milliseconds
96.86% <= 4 milliseconds
98.24% <= 5 milliseconds
98.79% <= 6 milliseconds
99.38% <= 7 milliseconds
99.68% <= 8 milliseconds
99.80% <= 9 milliseconds
99.85% <= 10 milliseconds
99.88% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
99.98% <= 15 milliseconds
99.99% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 17 milliseconds
18,782.87 requests per second

====== SPOP ======
  100000 requests completed in 5.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

26.16% <= 1 milliseconds
81.76% <= 2 milliseconds
92.27% <= 3 milliseconds
96.34% <= 4 milliseconds
97.95% <= 5 milliseconds
98.64% <= 6 milliseconds
99.14% <= 7 milliseconds
99.45% <= 8 milliseconds
99.52% <= 9 milliseconds
99.58% <= 10 milliseconds
99.60% <= 11 milliseconds
99.67% <= 12 milliseconds
99.76% <= 13 milliseconds
99.82% <= 14 milliseconds
99.88% <= 15 milliseconds
99.94% <= 16 milliseconds
99.95% <= 17 milliseconds
99.96% <= 18 milliseconds
99.96% <= 19 milliseconds
99.96% <= 21 milliseconds
99.96% <= 38 milliseconds
99.99% <= 39 milliseconds
100.00% <= 39 milliseconds
18,604.65 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 5.58 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

22.20% <= 1 milliseconds
80.12% <= 2 milliseconds
93.10% <= 3 milliseconds
96.60% <= 4 milliseconds
98.02% <= 5 milliseconds
98.71% <= 6 milliseconds
99.23% <= 7 milliseconds
99.56% <= 8 milliseconds
99.72% <= 9 milliseconds
99.79% <= 10 milliseconds
99.83% <= 11 milliseconds
99.85% <= 12 milliseconds
99.86% <= 13 milliseconds
99.87% <= 14 milliseconds
99.91% <= 15 milliseconds
99.93% <= 16 milliseconds
99.93% <= 17 milliseconds
99.94% <= 18 milliseconds
99.95% <= 19 milliseconds
99.95% <= 20 milliseconds
99.97% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 24 milliseconds
17,914.73 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 5.52 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

22.54% <= 1 milliseconds
81.45% <= 2 milliseconds
92.25% <= 3 milliseconds
96.42% <= 4 milliseconds
98.07% <= 5 milliseconds
98.82% <= 6 milliseconds
99.29% <= 7 milliseconds
99.61% <= 8 milliseconds
99.76% <= 9 milliseconds
99.83% <= 10 milliseconds
99.88% <= 11 milliseconds
99.88% <= 12 milliseconds
99.89% <= 13 milliseconds
99.92% <= 14 milliseconds
99.96% <= 15 milliseconds
99.96% <= 18 milliseconds
99.97% <= 19 milliseconds
99.98% <= 20 milliseconds
99.98% <= 26 milliseconds
99.98% <= 27 milliseconds
99.99% <= 28 milliseconds
100.00% <= 29 milliseconds
100.00% <= 30 milliseconds
18,129.08 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

16.62% <= 1 milliseconds
76.37% <= 2 milliseconds
90.98% <= 3 milliseconds
95.70% <= 4 milliseconds
97.77% <= 5 milliseconds
98.63% <= 6 milliseconds
99.37% <= 7 milliseconds
99.67% <= 8 milliseconds
99.76% <= 9 milliseconds
99.86% <= 10 milliseconds
99.90% <= 11 milliseconds
99.93% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
16,995.24 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 6.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

12.56% <= 1 milliseconds
74.37% <= 2 milliseconds
91.71% <= 3 milliseconds
95.93% <= 4 milliseconds
98.00% <= 5 milliseconds
98.93% <= 6 milliseconds
99.46% <= 7 milliseconds
99.75% <= 8 milliseconds
99.90% <= 9 milliseconds
99.97% <= 10 milliseconds
99.98% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 12 milliseconds
16,155.09 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

15.77% <= 1 milliseconds
74.06% <= 2 milliseconds
89.79% <= 3 milliseconds
95.04% <= 4 milliseconds
97.40% <= 5 milliseconds
98.46% <= 6 milliseconds
99.07% <= 7 milliseconds
99.58% <= 8 milliseconds
99.79% <= 9 milliseconds
99.83% <= 10 milliseconds
99.88% <= 11 milliseconds
99.89% <= 12 milliseconds
99.93% <= 13 milliseconds
99.95% <= 14 milliseconds
99.96% <= 15 milliseconds
99.96% <= 19 milliseconds
99.96% <= 20 milliseconds
99.96% <= 21 milliseconds
99.97% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 23 milliseconds
16,225.86 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 5.40 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

23.60% <= 1 milliseconds
77.74% <= 2 milliseconds
92.33% <= 3 milliseconds
96.75% <= 4 milliseconds
98.36% <= 5 milliseconds
99.04% <= 6 milliseconds
99.47% <= 7 milliseconds
99.69% <= 8 milliseconds
99.82% <= 9 milliseconds
99.86% <= 10 milliseconds
99.89% <= 11 milliseconds
99.93% <= 12 milliseconds
99.96% <= 13 milliseconds
99.97% <= 14 milliseconds
99.97% <= 15 milliseconds
99.99% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 21 milliseconds
18,504.81 requests per second